
# 1️⃣ Базовый класс
# Создай класс Worker, у которого есть:
# атрибут name
# метод work(), который выводит:
 
# Worker is working
 

# 2️⃣ Дочерние классы
# Создай два дочерних класса:
# Developer(Worker)
# Designer(Worker)
# В каждом классе:
# переопредели метод work()
# выведи своё сообщение
# (например: Developer writes code, Designer creates design)
 
# 3️⃣ Полиморфизм
# Создай список работников:
# workers = [
#     Developer("Alex"),
#     Designer("Kate"),
#     Worker("Sam")
# ]
# Пройдись циклом и вызови метод work() у каждого объекта.
# 👉 Один и тот же метод work() должен вести себя по-разному.
 
# 4️⃣ Работа с Git
# Сохрани код в файл main.py
# Создай репозиторий на GitHub
# Сделай commit и push в свой репозиторий
# ...Collsapse

class Worker:
    